package task3;

/**
 * @author Vitalii Myroniuk
 *
 * Порядок ініціалізації об'єктів в Java?
 *
 * В-дь:
 *  1) Статичні змінні та блоки ініцілізації в порядку їх оголошення.
 *     Слід зазначити, що спочатку загружається уся статика найстаршого класу в ієрархії наслідування,
 *     потім його нащадка і т.д. аж до того класу, що зараз викликається.
 *     Статика загружається лише раз, тобто при повторному зверненні до класу,
 *     ініціалізація статичних полів та блоків уже не буде відбуватись.
 *  2) Змінні та блоки ініцілізації в порядку їх оголошення для найстаршого класу в ієрархії наслідування.
 *     Далі тіло конструктора цього класу, що визивається іншим конструктором цього класу
 *     за допомогою this(...) і т.д.
 *  3) Конструктор нащадка, який явно чи неявно викликає конструктор свого суперкласа super(...).
 *     Далі інший конструктор класу (якщо він є), який викликає поточний конструктор за допомогою this(...).
 *  4) Подальша процедура аналогічна попередньому пункту аж до виконання конструтора класу,
 *     об'єкт якого ми створюємо. При створенні нового об'єкта, буде відбуватись повторна
 *     ініціалізація усіх полів та блоків.
 */
public class Main {
    public static void main(String[] args) {
        new Child();
        System.out.println();
        new Child();
//        Child.init("init");
    }
}
