package task3;

/**
 * @author Vitalii Myroniuk
 *
 * Порядок ініціалізації об'єктів в Java?
 *
 * В-дь:
 *  1) Статичні змінні та блоки ініцілізації в порядку їх оголошення.
 *     Слід зазначити, що спочатку загружається уся статика найстаршого класу в ієрархії наслідування,
 *     потім його нащадка і т.д. аж до того класу, що зараз викликається.
 *     Статика загружається лише раз, тобто при повторному зверненні до класу,
 *     ініціалізація статичних полів та блоків уже не буде відбуватись.
 *  2) Змінні та блоки ініцілізації в порядку їх оголошення.
 *     Слід зазначити, що спочатку проходить ініціаізація найстаршого класу в ієрархії наслідування,
 *     потім його нащадка і т.д. аж до того класу, об'єкт якого зараз створюється.
 *     При створенні нового об'єкта, буде відбуватись повторна ініціалізація усіх полів та блоків.
 *  3) Заходимо в конструктор нащадка, який викликає або інший свій контруктор this(...)
 *     або явно чи неявно конструктор суперкласа super(...). Однак рано чи пізно всеодно має бути викликаний
 *     конструктор суперкласа. Подальша процедура аналогічна аж до конструтора класу Object.
 *     Після цього відбувається виконання тіла кожного конструктора йдучи від найстаршого класу до наймолодшого.
 */
public class Main {
    public static void main(String[] args) {
        new Child();
        System.out.println();
        new Child();
    }
}
