package task6;

/**
 * @author Vitalii Myroniuk
 *
 * Як створити immutable клас?
 *
 * В-дь:
 * 1)	Зробити усі поля private та final.
 * 2)	Видалити усі сетери та методи, які дозволяють змінювати поля класу.
 * 3)	Запобігти переозначування методів. Найпростіший спосіб це зробити – позначити клас модифікатором final.
 *      Інший спосіб – зробити конструктор приватним і створювати об’єкти у статичному фабричному методі.
 * 4)	Якщо клас містить змінні, що посилаються на mutable об’єкт, то потрібно запобігти витоку цих посилань
 *      за межі класу:
 *         a)	В конструкторі присвоювати копії mutable об’єктів;
 *         b)	В гетерах завжди повертати копії mutable об’єктів.
 */
public class Main {

    // TODO not finished yet

}
